# ===============================================================================|
# Цей код написано Безверхим Олександром
try:
    # Відкриваємо файл 'questions.txt' у режимі запису ('а')
    with open('questions.txt', 'a') as file:
        # Запитуємо у користувача прізвище
        surname = input("Введіть ваше прізвище: ")
        # Зуєва додала у користувача питання з програмування мовою Python
        answer = input("Віповідь на попереднє питання: ")

        question = input("Введіть ваше питання з програмування мовою Python: ")

        # Записуємо прізвище у файл
        file.write(surname + '\n')
        # Зуєва дописала  відповідь на попереднє питання у файл
        file.write(answer + '\n')
        # Записуємо питання у файл
        file.write(question + '\n')

    # Якщо все пройшло успішно, виводимо повідомлення про успішне завершення запису
    print("Дані успішно записано у файл questions.txt")
except IOError:
    # В разі виникнення помилки виводимо повідомлення про невдалу спробу запису у файл
    print("Помилка: не вдалося записати дані у файл")

# Після запуску коду структура файлу questions.txt наступна:
# Рядок 1: Прізвище студента ("Безверхий Олександр").
# Рядок 2: Питання з програмування мовою Python ("Скільки типів даних є в мові програмування Python?").
# ===============================================================================|
# Зуєва - дописала відповідь на попереднє запитання
# Додала нове питання для наступного студента# Після запуску коду структура файлу questions.txt наступна:
# Рядок 3: Прізвище студента ("Зуєва Христина").
# Рядок 4: Відповідь на питання з програмування мовою Python: "int, float, str,bool,list, tuple, dict, set - 8 типів даних"
# Рядок 5: Питання з програмування мовою Python: "Яким чином можна відкрити файл в python?"
# ===============================================================================|
# Багно - дописав відповідь на попереднє запитання
# Додав нове питання для наступного студента# Після запуску коду структура файлу questions.txt наступна:
# Рядок 6: Прізвище студента ("Багно Тимофій").
# Рядок 7: Відповідь на питання з програмування мовою Python:
#   "Відкривати файли в Python можна за допомогою вбудованої функції open().
#   Модифікатори відкривання: 'r' - для читання, 'w' - для запису, 'a' - для дозапису."
# Рядок 8: Питання з програмування мовою Python: "Як в пайтоні працювати з форматом json?"
# ===============================================================================|
# Савченко - дописав відповідь на попереднє запитання
# Додав нове питання для наступного студента# Після запуску коду структура файлу questions.txt наступна:
# Рядок 9: Прізвище студента ("Савченко Максим").
# Рядок 10: Відповідь на питання з програмування мовою Python:
#   Робота з форматом JSON у Python включає кілька основних кроків:
# Імпорт бібліотеки: Використовуйте import json для доступу до функцій JSON.
# Читання JSON: Використовуйте json.load() або json.loads() для читання JSON з файлу або рядка відповідно.
# Запис JSON: Використовуйте json.dump() або json.dumps() для запису об’єкта Python у формат JSON у файл або рядок відповідно.
# Обробка даних: Після читання JSON ви можете працювати з ним як зі звичайним словником або списком у Python.
# Рядок 11: Питання з програмування мовою Python: "Хто створив мову програмування Python?"
# ===============================================================================|
# Добродумов Нікіта
# Додав нове питання для наступного студента 
# Після запуску коду структура файлу questions.txt наступна:    
# Рядок 12: Прізвище студента ("Добродумов Нікіта").    
# Рядок 13: Відповідь на питання з програмування мовою Python:    
# "Мову програмування Python створив Гвідо ван Россум"    
# Мову програмування Python створив Гвідо ван Россум
# Рядок 14: Питання з програмування мовою Python:"Чи вважається Python популярною мовою програмування?"
# ===============================================================================|
