# ===============================================================================
# Цей код написано Безверхим Олександром
try:
    # Відкриваємо файл 'questions.txt' у режимі запису ('а')
    with open('questions.txt', 'a') as file:
        # Запитуємо у користувача прізвище
        surname = input("Введіть ваше прізвище: ")
        # Зуєва додала у користувача питання з програмування мовою Python
        answer = input("Віповідь на попереднє питання: ")

        question = input("Введіть ваше питання з програмування мовою Python: ")

        # Записуємо прізвище у файл
        file.write(surname + '\n')
        # Зуєва дописала  відповідь на попереднє питання у файл
        file.write(answer + '\n')
        # Записуємо питання у файл
        file.write(question + '\n')

    # Якщо все пройшло успішно, виводимо повідомлення про успішне завершення запису
    print("Дані успішно записано у файл questions.txt")
except IOError:
    # В разі виникнення помилки виводимо повідомлення про невдалу спробу запису у файл
    print("Помилка: не вдалося записати дані у файл")

# Після запуску коду структура файлу questions.txt наступна:
# Рядок 1: Прізвище студента ("Безверхий Олександр").
# Рядок 2: Питання з програмування мовою Python ("Скільки типів даних є в мові програмування Python?").
# ===============================================================================
#Зуєва - дописала відповідь на попереднє запитання
#Додала нове питання для наступного студента# Після запуску коду структура файлу questions.txt наступна:
# Рядок 3: Прізвище студента ("Безверхий Олександр").
# Рядок 4: int, float, str,bool,list, tuple, dict, set - 8 типів даних
#Рядок 5: Яким чином можна відкрити файл в python?
#======================================================# ===============================================================================
