#================================================================================
#Цей код було написано Безверхим Олександром
try:
    with open('questions.txt', 'w') as file:
        surname = input("Введіть ваше прізвище: ")
        question = input("Введіть ваше питання з програмування мовою Python: ")
        file.write(surname + '\n')
        file.write(question + '\n')
    print("Дані успішно записано у файл questions..txt")
except IOError:
    print("Помилка: не вдалося записати дані у файл")
#================================================================================
