text = "За вікном починається весна. Перші промені сонця лагідно торкаються землі, пробуджуючи природу. Краплини роси блищать на молодій траві, немов діаманти. Птахи повертаються з теплих країв, наповнюючи повітря своїм співом. Все навколо оживає, і серце переповнюється радістю та надією на нове життя. Весна — це час змін, нових починань та безмежних можливостей."

# 1. Розділення рядка на слова за допомогою методу split()
words = text.split()

# 2. Підрахунок кількості слів у тексті за допомогою функції len()
num_words = len(words)

# 3. Перетворення рядка у верхній регістр за допомогою методу upper()
uppercase_text = text.upper()

print("Вивід результатів роботи функцій split(), len() та upper():")
print("Розділення рядка на слова:", words)
print("Кількість слів у тексті:", num_words)
print("Текст у верхньому регістрі:", uppercase_text)
